* >Natural Source Header 000000
* :Mode S
* :CP
* :LineIncrement 10
* <Natural Source Header

DEFINE DATA PARAMETER
USING NCCRA
LOCAL
USING NCDEMAPL
END-DEFINE
*
MOVE BY NAME CRUISE TO NCCRUISE
*
  MOVE CRUISE.YACHT-ID TO NCCRUISE.ID-YACHT
*
  IF NCCRUISE.CRUISE-ID > 0 THEN
*
    STORE NCCRUISE

    END TRANSACTION
*
  ELSE
    RESET CRUISE
    ESCAPE ROUTINE
  END-IF
*
END

