* >Natural Source Header 000000
* :Mode S
* :CP
* :LineIncrement 10
* <Natural Source Header
* MAP2: PROTOTYPE              --- CREATED BY WNT 9.1.2 ---
* INPUT USING MAP 'XXXXXXXX'
*     #E-CITY(*) #E-FIRST-NAME(*) #E-NAME(*) #E-PERSONNEL-ID(*)
*     #E-SELEKTION(*) #E-SUCHEN-AB
DEFINE DATA PARAMETER
1 #E-CITY (A020/00001:00015)
1 #E-FIRST-NAME (A020/00001:00015)
1 #E-NAME (A020/00001:00015)
1 #E-PERSONNEL-ID (A008/00001:00015)
1 #E-SELEKTION (A001/00001:00015)
1 #E-SUCHEN-AB (N08.0)
END-DEFINE
FORMAT PS=021 LS=079 ZP=OFF SG=OFF KD=ON  IP=OFF
* MAP2: MAP PROFILES *****************************        200***********
* .TTAAAMMOO   D I D I N D I D I        ?_)^&:+(                       *
* 023079        N1NNLCN             X        01 SYSDBA  YR             *
************************************************************************
INPUT          (     IP=OFF                                           /*
                                                                       )
 001T *APPLIC-ID  (AD=DLOFHT ) /*.01S008 A008 .
 026T 'Personal-Management-System'
 070T *DATD  (AD=DLOFHT ) /*.01S008 A008 .
/
 001T *PROGRAM  (AD=DLOFHT ) /*.01S008 A008 .
 028T 'MitarbeiterÃ¼bersicht'
 068T *TIME  (AD=DLOFHT ) /*.01S010 A010 .
/
 001T '-' (077)
/
/
 005T 'Pers-Nr'
 014T 'Name'
 035T 'Vorname'
 056T 'Wohnort'
/
 003T #E-SELEKTION (001)  (AD=DLAFHW ) /*.99U001 A001 .
   /**A1000150000100001000010000100001100015001001000001000HV
 005T #E-PERSONNEL-ID (1+000)  (AD=DLOFHT ) /*.01U008 A008 .
   /**A1000150000100001000010000100001100015001001000001000HV
 014T #E-NAME (1+000)  (AD=DLOFHW ) /*.01U020 A020 .
   /**A1000150000100001000010000100001100015001001000001000HV
 035T #E-FIRST-NAME (1+000)  (AD=DLOFHW ) /*.01U020 A020 .
   /**A1000150000100001000010000100001100015001001000001000HV
 056T #E-CITY (1+000)  (AD=DLOFHW ) /*.01U020 A020 .
   /**A1000150000100001000010000100001100015001001000001000HV
/
 003T #E-SELEKTION (002)  (AD=DLAFHW ) /*.99U001 A001 .
 005T #E-PERSONNEL-ID (1+001)  (AD=DLOFHT ) /*.01U008 A008 .
 014T #E-NAME (1+001)  (AD=DLOFHW ) /*.01U020 A020 .
 035T #E-FIRST-NAME (1+001)  (AD=DLOFHW ) /*.01U020 A020 .
 056T #E-CITY (1+001)  (AD=DLOFHW ) /*.01U020 A020 .
/
 003T #E-SELEKTION (003)  (AD=DLAFHW ) /*.99U001 A001 .
 005T #E-PERSONNEL-ID (1+002)  (AD=DLOFHT ) /*.01U008 A008 .
 014T #E-NAME (1+002)  (AD=DLOFHW ) /*.01U020 A020 .
 035T #E-FIRST-NAME (1+002)  (AD=DLOFHW ) /*.01U020 A020 .
 056T #E-CITY (1+002)  (AD=DLOFHW ) /*.01U020 A020 .
/
 003T #E-SELEKTION (004)  (AD=DLAFHW ) /*.99U001 A001 .
 005T #E-PERSONNEL-ID (1+003)  (AD=DLOFHT ) /*.01U008 A008 .
 014T #E-NAME (1+003)  (AD=DLOFHW ) /*.01U020 A020 .
 035T #E-FIRST-NAME (1+003)  (AD=DLOFHW ) /*.01U020 A020 .
 056T #E-CITY (1+003)  (AD=DLOFHW ) /*.01U020 A020 .
/
 003T #E-SELEKTION (005)  (AD=DLAFHW ) /*.99U001 A001 .
 005T #E-PERSONNEL-ID (1+004)  (AD=DLOFHT ) /*.01U008 A008 .
 014T #E-NAME (1+004)  (AD=DLOFHW ) /*.01U020 A020 .
 035T #E-FIRST-NAME (1+004)  (AD=DLOFHW ) /*.01U020 A020 .
 056T #E-CITY (1+004)  (AD=DLOFHW ) /*.01U020 A020 .
/
 003T #E-SELEKTION (006)  (AD=DLAFHW ) /*.99U001 A001 .
 005T #E-PERSONNEL-ID (1+005)  (AD=DLOFHT ) /*.01U008 A008 .
 014T #E-NAME (1+005)  (AD=DLOFHW ) /*.01U020 A020 .
 035T #E-FIRST-NAME (1+005)  (AD=DLOFHW ) /*.01U020 A020 .
 056T #E-CITY (1+005)  (AD=DLOFHW ) /*.01U020 A020 .
/
 003T #E-SELEKTION (007)  (AD=DLAFHW ) /*.99U001 A001 .
 005T #E-PERSONNEL-ID (1+006)  (AD=DLOFHT ) /*.01U008 A008 .
 014T #E-NAME (1+006)  (AD=DLOFHW ) /*.01U020 A020 .
 035T #E-FIRST-NAME (1+006)  (AD=DLOFHW ) /*.01U020 A020 .
 056T #E-CITY (1+006)  (AD=DLOFHW ) /*.01U020 A020 .
/
 003T #E-SELEKTION (008)  (AD=DLAFHW ) /*.99U001 A001 .
 005T #E-PERSONNEL-ID (1+007)  (AD=DLOFHT ) /*.01U008 A008 .
 014T #E-NAME (1+007)  (AD=DLOFHW ) /*.01U020 A020 .
 035T #E-FIRST-NAME (1+007)  (AD=DLOFHW ) /*.01U020 A020 .
 056T #E-CITY (1+007)  (AD=DLOFHW ) /*.01U020 A020 .
/
 003T #E-SELEKTION (009)  (AD=DLAFHW ) /*.99U001 A001 .
 005T #E-PERSONNEL-ID (1+008)  (AD=DLOFHT ) /*.01U008 A008 .
 014T #E-NAME (1+008)  (AD=DLOFHW ) /*.01U020 A020 .
 035T #E-FIRST-NAME (1+008)  (AD=DLOFHW ) /*.01U020 A020 .
 056T #E-CITY (1+008)  (AD=DLOFHW ) /*.01U020 A020 .
/
 003T #E-SELEKTION (010)  (AD=DLAFHW ) /*.99U001 A001 .
 005T #E-PERSONNEL-ID (1+009)  (AD=DLOFHT ) /*.01U008 A008 .
 014T #E-NAME (1+009)  (AD=DLOFHW ) /*.01U020 A020 .
 035T #E-FIRST-NAME (1+009)  (AD=DLOFHW ) /*.01U020 A020 .
 056T #E-CITY (1+009)  (AD=DLOFHW ) /*.01U020 A020 .
/
 003T #E-SELEKTION (011)  (AD=DLAFHW ) /*.99U001 A001 .
 005T #E-PERSONNEL-ID (1+010)  (AD=DLOFHT ) /*.01U008 A008 .
 014T #E-NAME (1+010)  (AD=DLOFHW ) /*.01U020 A020 .
 035T #E-FIRST-NAME (1+010)  (AD=DLOFHW ) /*.01U020 A020 .
 056T #E-CITY (1+010)  (AD=DLOFHW ) /*.01U020 A020 .
/
 003T #E-SELEKTION (012)  (AD=DLAFHW ) /*.99U001 A001 .
 005T #E-PERSONNEL-ID (1+011)  (AD=DLOFHT ) /*.01U008 A008 .
 014T #E-NAME (1+011)  (AD=DLOFHW ) /*.01U020 A020 .
 035T #E-FIRST-NAME (1+011)  (AD=DLOFHW ) /*.01U020 A020 .
 056T #E-CITY (1+011)  (AD=DLOFHW ) /*.01U020 A020 .
/
 003T #E-SELEKTION (013)  (AD=DLAFHW ) /*.99U001 A001 .
 005T #E-PERSONNEL-ID (1+012)  (AD=DLOFHT ) /*.01U008 A008 .
 014T #E-NAME (1+012)  (AD=DLOFHW ) /*.01U020 A020 .
 035T #E-FIRST-NAME (1+012)  (AD=DLOFHW ) /*.01U020 A020 .
 056T #E-CITY (1+012)  (AD=DLOFHW ) /*.01U020 A020 .
/
 003T #E-SELEKTION (014)  (AD=DLAFHW ) /*.99U001 A001 .
 005T #E-PERSONNEL-ID (1+013)  (AD=DLOFHT ) /*.01U008 A008 .
 014T #E-NAME (1+013)  (AD=DLOFHW ) /*.01U020 A020 .
 035T #E-FIRST-NAME (1+013)  (AD=DLOFHW ) /*.01U020 A020 .
 056T #E-CITY (1+013)  (AD=DLOFHW ) /*.01U020 A020 .
/
 003T #E-SELEKTION (015)  (AD=DLAFHW ) /*.99U001 A001 .
 005T #E-PERSONNEL-ID (1+014)  (AD=DLOFHT ) /*.01U008 A008 .
 014T #E-NAME (1+014)  (AD=DLOFHW ) /*.01U020 A020 .
 035T #E-FIRST-NAME (1+014)  (AD=DLOFHW ) /*.01U020 A020 .
 056T #E-CITY (1+014)  (AD=DLOFHW ) /*.01U020 A020 .
/
 056T 'Suchen ab:'
 068T #E-SUCHEN-AB  (AD=DLAFHT ) /*.99U008 N08.0.
* MAP2: VALIDATION *****************************************************
* MAP2: END OF MAP *****************************************************
END
