* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program JOB1.
/**
/** :author WOHE
/* TODO Enter your code here

WRITE *PROGRAM

END
