* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program BAT1.
/**
/** :author WOHE
/* TODO Enter your code here
END
