DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
/** New Parameter Data Area NCCRA.
/**
/** :author ziv
1 CRUISE
  2 CRUISE-ID (N08)
  2 START-HARBOR (A020)
  2 DESTINATION-HARBOR (A020)
  2 START-DATE (N08)
  2 START-TIME (N06)
  2 END-DATE (N08)
  2 END-TIME (N06)
  2 PRICE-1W (P10.3)
  2 PRICE-2W (P10.3)
  2 PRICE-3W (P10.3)
  2 CRUISE-STATUS (A01)
  2 YACHT-ID (N8.0)
  2 YACHT-NAME (A30)
END-DEFINE
