* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program CALLEMPS.
/**
/** :author WOHE
/* TODO Enter your code here

DEFINE DATA LOCAL
    01 EMPLOYEE VIEW OF EMPLOYEES
      02 PERSONNEL-ID
      02 NAME
      02 FIRST-NAME
      02 ADDRESS-LINE(1:1)
      02 CITY
      02 ZIP
    01 #IMAX (I4)
/*WIN    01 WORKF1 (A100)
END-DEFINE
*

CALLNAT 'FINDEMPS' PERSONNEL-ID NAME FIRST-NAME
ADDRESS-LINE(1:1) CITY ZIP

END
