* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program WRITEWHP.
/**
/** :author WOHE
/* TODO Enter your code here

INPUT (AD=O) "Mein "
H'0D' H'0A'
INPUT (AD=O) "Programm"

END
