* >Natural Source Header 000000
* :Mode S
* :CP
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA LOCAL USING NSWVEHIC
LOCAL
1 MAKE-HISTO VIEW OF VEHICLES
  2 MAKE (A20)
1 #MAKE (A20)
1 #MODEL (A20)
END-DEFINE
HISTOGRAM MAKE-HISTO FOR MAKE
    ASSIGN #MAKE = MAKE
/*
   READ NSWVEHIC LOGICAL BY MAKE
/*   sorted by make model

DISPLAY MAKE MODEL
    END-READ

END-HISTOGRAM


END
