* >Natural Source Header 000000
* :Mode S
* :CP
* :LineIncrement 10
* <Natural Source Header
/** New Program PGM.
/**
/** :author hjc
/* TODO: Enter your code here
DEFINE DATA LOCAL
01 #IN (A10)
01 #OUT (A10)
END-DEFINE
ASSIGN #IN := 'rein'
CALLNAT 'SUB'
  #IN
  #OUT
  DISPLAY #IN #OUT
END
