* >Natural Source Header 000000
* :Mode S
* :CP
* :LineIncrement 10
* <Natural Source Header
* Name: Grid Demos/Textgrid
DEFINE DATA LOCAL



1 EMP VIEW OF EMPLOYEES
  2 NAME
  2 COUNTRY
  2 DEPT

1 HISTO VIEW OF EMPLOYEES
 2 DEPARTMENT
END-DEFINE

 READ EMP LOGICAL BY NAME
 IF COUNTRY = 'E'
 DISPLAY NAME COUNTRY DEPT
* ASSIGN COUNTRY := 'D'

* UPDATE
* END TRANSACTION
 END-IF
 END-READ

END
