DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
1 EMPLOY-VIEW VIEW OF EMPLOYEES
  2 PERSONNEL-ID (A8)
  2 FIRST-NAME (A20)
  2 NAME (A20)
  2 ADDRESS-LINE (A20/1:1) /* MU-FIELD
  2 CITY (A20)
  2 ZIP (A10)
  2 AREA-CODE (A6)
  2 PHONE (A15)
  2 JOB-TITLE (A25)
  2 CURR-CODE (A3/1:1)
  2 SALARY (P9.0/1:1)
  2 BONUS (P9.0/1:1,1:1) /* MU-FIELD
END-DEFINE
