DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
1 CAR VIEW OF VEHICLES
  2 REG-NUM (A15)
  2 CHASSIS-NUM (B4)
  2 PERSONNEL-ID (A8)
  2 MAKE (A20)
  2 MODEL (A20)
  2 COLOR (A10)
  2 YEAR (N4.0)
  2 CLASS (A1)
  2 MAINT-COST (P7.0/1:5) /* MU-FIELD
END-DEFINE
