DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
/** New Parameter Data Area LISEMPL.
/**
/** :author WOHE
/* TODO Enter your data definitions here


    01  #DEPT (A6)
    01  #NAME (A20)
    01  #FIRST-NAME (A20)
    01  #PERSONNEL-ID (A8)

01 PERSVAL (A8)


END-DEFINE
